<template>
  <div class="flex items-center lg:w-3/5 xl:w-3/6 justify-start w-full">
    <div class="flex relative">
      <span :class="spanClasses">О себе</span>
      <p class="xl:leading-8 text-justify sm:text-lg text-sm">
        {{ description }}
      </p>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      spanClasses: [
        // "bg-red-500",
        "flex",
        "items-center",
        "text-main-secondary",
        "tracking-[2px]",
        "absolute",
        "-top-[20%]",
        "-left-10%",
        "py-2",
        "after:border-dashed",
        "after:border",
        "after:border-main-secondary",
        "after:absolute",
        "after:w-full",
        "after:-bottom-0",
        "after:left-0",
      ],
      description:
        "Я веб-разработчик и дизайнер, который занимается созданием веб-сайтов с 2016 года. Я специализируюсь на доступности, производительности и удобстве использования, не жертвуя творческим потенциалом. Вероятно, я не типичный разработчик, работающий с Node.JS, PHPH или С#  и настраивающий докеры, но я проектирую, погружаясь в суть задачи, настраивая  от размера шрифтов и обдумывая макеты, в это время вы можете видеть меня таким(~_^). Я стремлюсь создавать масштабируемый код, пишу код так, чтобы после меня коллеги не говорили: и как мне это разгребать?🤦. А наоборот говорили:  О как все понятно написано👌, чой обкэ, ща решим. Опираясь при этом только на нужные инструменты.",
    };
  },
};
</script>
